<template>
  <div class="banner flex-column justify-content:center align-items:center">
    <form class="m-1" @submit.prevent="searchBanks({province, city, bank})">
      <b-form-group label="광역시/도" label-for="province" label-cols-md="auto" class="mb-3">
        <b-form-select id="province" v-model="province" :options="provinces"></b-form-select>
      </b-form-group>
      <b-form-group label="시/군/구" label-for="city" label-cols-md="auto" class="mb-3">
        <b-form-select id="city" v-model="city" :options="cities[province]"></b-form-select>
      </b-form-group>
      <b-form-group label="은행명" label-for="bank" label-cols-md="auto" class="mb-3">
        <b-form-select id="bank" v-model="bank" :options="banks"></b-form-select>
      </b-form-group>
      <button type="submit" class="btn btn-primary">이동</button>
    </form>
  </div>
</template>

<script>
export default {
  data() {
      return {
        province: '전체',
        city: '전체',
        bank: '전체',
        provinces: [
          '전체',
          '서울특별시',
          '인천광역시',
          '대전광역시',
          '대구광역시',
          '광주광역시',
          '부산광역시',
          '울산광역시',
          '세종특별자치시',
          '경기도',
          '강원도',
          '충청북도',
          '충청남도',
          '경상북도',
          '경상남도',
          '전라북도',
          '전라남도',
          '제주특별자치도',
        ],
        cities: {
          '전체': ['전체'],
          '서울특별시': ['강남구', '강동구', '강북구', '강서구', '관악구', '광진구', '구로구', '금천구', '노원구', '도봉구', '동대문구', '동작구', '마포구', '서대문구', '서초구', '성동구', '성북구', '송파구', '양천구', '영등포구', '용산구', '은평구', '종로구', '중구', '중랑구'],
          '인천광역시': ['강화군', '계양구', '동구', '미추홀구', '부평구', '서구', '연수구', '옹진군', '중구', '남동구'],
          '대전광역시': ['대덕구', '동구', '서구', '유성구', '중구'],
          '대구광역시': ['군위군', '남구', '달서구', '달성군', '동구', '북구', '서구', '수성구', '중구'],
          '광주광역시': ['광산구', '남구', '동구', '북구', '서구'],
          '부산광역시': ['강서구', '금정구', '기장군', '남구', '동구', '동래구', '부산진구', '북구', '사상구', '사하구', '서구', '수영구', '영도구', '중구', '해운대구', '연제구'],
          '울산광역시': ['남구', '동구', '북구', '울주군', '중구'],
          '세종특별자치시': ['세종시'],
          '경기도': ['가평군', '과천시', '광명시', '광주시', '구리시', '군포시', '김포시', '남양주시', '동두천시', '부천시', '성남시', '수원시', '시흥시', '안산시', '안성시', '안양시', '양주시', '양평군', '여주시', '연천군', '오산시', '용인시', '의왕시', '의정부시', '이천시', '파주시', '평택시', '포천시', '화성시'],
          '강원도': ['강릉시', '고성군', '동해시', '삼척시', '양구군', '양양군', '영월군', '원주시', '인제군', '정선군', '철원군', '춘천시', '태백시', '평창군', '화천군', '횡성군', '속초시', '홍천군'],
          '충청북도': ['괴산군', '단양군', '보은군', '영동군', '옥천군', '증평군', '진천군', '청주시', '충주시', '제천시'],
          '충청남도': ['계룡시', '공주시', '금산군', '논산시', '당진시', '보령시', '부여군', '서산시', '서천군', '아산시', '예산군', '천안시', '청양군', '태안군', '홍성군'],
          '경상북도': ['경산시', '경주시', '고령군', '구미시', '군위군', '김천시', '문경시', '봉화군', '상주시', '성주군', '안동시', '영덕군', '영양군', '영주시', '영천시', '예천군', '울릉군', '울진군', '의성군', '청도군', '청송군', '칠곡군', '포항시'],
          '경상남도': ['거제시', '거창군', '고성군', '김해시', '남해군', '밀양시', '사천시', '산청군', '양산시', '의령군', '진주시', '창녕군', '창원시', '통영시', '하동군', '함안군', '함양군', '합천군'],
          '전라북도': ['고창군', '군산시', '김제시', '남원시', '무주군', '부안군', '순창군', '익산시', '임실군', '전주시', '정읍시', '진안군', '장수군', '완주군'],
          '전라남도': ['강진군', '고흥군', '곡성군', '광양시', '구례군', '나주시', '담양군', '무안군', '목포시', '보성군', '순천시', '신안군', '여수시', '영광군', '영암군', '완도군', '장성군', '장흥군', '진도군', '함평군', '해남군', '화순군'],
          '제주특별자치도': ['제주시', '서귀포시'],
        },
        banks: [
          '전체',
          '우리은행',
          '한국스탠다드차타드은행',
          '대구은행',
          '부산은행',
          '광주은행',
          '제주은행',
          '전북은행',
          '경남은행',
          '중소기업은행',
          '한국산업은행',
          '국민은행',
          '신한은행',
          '농협은행주식회사',
          '하나은행',
          '주식회사 케이뱅크',
          '수협은행',
          '주식회사 카카오뱅크',
          '토스뱅크 주식회사',
        ],
      }
    },
    methods: {
      searchBanks(data) {
        this.$emit('search-banks', data)
      }
    }

}
</script>

<style>
label{
  font-weight: bold;
}

.banner {
  /* width:20% ; */
  height: 100%;
  background-color: #7ab87d; /* 배너 배경색 */
  color: #fff; /* 배너 텍스트 색상 */
  padding: 10px 10px; /* 내부 여백 설정 */
  /* border-radius: 6px; 모서리를 둥글게 */
  border-top-left-radius: 10px;
  border-bottom-left-radius:10px;
  align-items: center;
  
  /* display: flex; */
}

.banner button {
  background-color: #fff; /* 버튼 배경색 */
  color: #7ab87d; /* 버튼 텍스트 색상 */
  padding: 8px 16px; /* 버튼 여백 설정 */
  border-radius: px; /* 모서리를 둥글게 */
  border: none; /* 테두리 제거 */
  font-weight: bold;
  cursor: pointer;
}

.banner button:hover {
  background-color: #e5e5e5; /* 마우스 오버 시 배경색 변경 */
}
</style>